src/cf/src/AccumulationRegisters/ТоварыВНаличии/ТоварыВНаличии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВНаличии</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ДополнительныеРасходы/ДополнительныеРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДополнительныеРасходы</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

src/cf/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХозяйственныеОперации</name>
  <enumValues>
    <name>АвансКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВКассу</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщика</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеОприходование</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеСписание</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеДенежныхСредствНаБанковскийСчет</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНалоговИВзносов</name>
  </enumValues>
  <enumValues>
    <name>ПланируемыеЦеныЗакупки</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассы</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствСБанковскогоСчета</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПродажаВКредит</name>
  </enumValues>
  <enumValues>
    <name>ПрочееПоступлениеДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ПрочийРасходДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>РазукомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиенту</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>СнятиеНаличныхДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>СписаниеЗадолженности</name>
  </enumValues>
  <enumValues>
    <name>УстановкаЦенНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОбналичиваниеЧека</name>
  </enumValues>
  <enumValues>
    <name>ОперационныеЗатраты</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>Инкассация</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>Полуфабрикат</name>
  </enumValues>
  <enumValues>
    <name>Сырье</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/АктРазбора/АктРазбора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктРазбора</name>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <attributes>
    <name>Количество</name>
    <type>
      <types>DefinedType.КоличествоНеотрицательное</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>DefinedType.КоличествоНеотрицательное</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияОприходование</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоляСтоимости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСерии</name>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Catalogs/МестаХранения/МестаХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МестаХранения</name>
  <predefined>
    <items>
      <name>StockEnCoursDeRoute</name>
      <description>Stock en cours de route</description>
    </items>
  </predefined>
  <attributes>
    <name>ДолжностьОтветственного</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещатьОМинимальномОстатке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоляОбщихРасходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодчиненныйСклад</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Налоговый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/AccumulationRegisters/ТоварыВНаличии/ManagerModule.bsl
#Область Формирование_движений

Функция СформироватьДвижения(ДокОбъект) Экспорт
	Движения = ДокОбъект.Движения;
	#Область Подготовим_данные_для_проведения
   	Если ДокОбъект.ДополнительныеСвойства.Свойство("ТЗТоварыССериями") Тогда
		ТЗТоварыССериями = ДокОбъект.ДополнительныеСвойства.ТЗТоварыССериями.Скопировать();
	Иначе
		ТЗТоварыССериями = СерииИРазмещение.ОбъединитьТоварыССериями(ДокОбъект);
	КонецЕсли;
	Если ТЗТоварыССериями.Колонки.Найти("СуммаСНДС") <> Неопределено Тогда 
		ТЗТоварыССериями.Колонки.Удалить("Сумма");
		ТЗТоварыССериями.Колонки.СуммаСНДС.Имя = "Сумма";
	КонецЕсли;
	#КонецОбласти
	ДвиженияСформированы = Ложь;
	ТекстОшибки = "";
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Тогда		
		ДобавитьДанныеОприходования(ТЗТоварыССериями, ДокОбъект);
		Движения.ТоварыВНаличии.Загрузить(ТЗТоварыССериями);
		РегистрыНакопления.ДополнительныеРасходы.РаспределитьНаСебестоимость(ДокОбъект);
		ДвиженияСформированы = Истина;
		Если ДвиженияСформированы И ЗначениеЗаполнено(ДокОбъект.МестоХранения.ПодчиненныйСклад) 
			И Не ДокОбъект.Контрагент = Справочники.Контрагенты.Migration Тогда
			ТЗТоварыВНаличии = Движения.ТоварыВНаличии.Выгрузить();
			Для Каждого Стр Из ТЗТоварыВНаличии Цикл
				Движение = Движения.ТоварыВНаличии.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, Стр);
				Движение.МестоХранения = ДокОбъект.МестоХранения.ПодчиненныйСклад;
			КонецЦикла;
			ТЗДополнительныеРасходы = Движения.ДополнительныеРасходы.Выгрузить();
			Для Каждого Стр Из ТЗДополнительныеРасходы Цикл
				Движение = Движения.ДополнительныеРасходы.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, Стр);
				Движение.МестоХранения = ДокОбъект.МестоХранения.ПодчиненныйСклад;	
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ОприходованиеТоваров") Тогда		
		ДобавитьДанныеОприходования(ТЗТоварыССериями, ДокОбъект);
		Движения.ТоварыВНаличии.Загрузить(ТЗТоварыССериями);
		ДвиженияСформированы = Истина;	
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		Если ДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.НакладнаяПоОтгрузкамТовара Тогда
			Возврат Истина
		КонецЕсли;
		ДвиженияСформированы = СписатьНоменклатуру(ТЗТоварыССериями, ДокОбъект, Ложь);
		Если ДвиженияСформированы Тогда
			РегистрыНакопления.ДополнительныеРасходы.РаспределитьНаСебестоимость(ДокОбъект);			
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.НалоговаяНакладная") Тогда
		ДвиженияСформированы = СписатьНоменклатуру(ТЗТоварыССериями, ДокОбъект, Ложь);
		Если ДвиженияСформированы Тогда
			РегистрыНакопления.ДополнительныеРасходы.РаспределитьНаСебестоимость(ДокОбъект);			
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ОтгрузкаТовара") Тогда
		ДвиженияСформированы = СписатьНоменклатуру(ТЗТоварыССериями, ДокОбъект, Ложь);
		Если ДвиженияСформированы Тогда
			РегистрыНакопления.ДополнительныеРасходы.РаспределитьНаСебестоимость(ДокОбъект);			
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.СписаниеТоваров") Тогда
		ДвиженияСформированы = СписатьНоменклатуру(ТЗТоварыССериями, ДокОбъект);	
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда
		СкладСписания = ?(ДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеСписание,ДокОбъект.МестоХранения,Справочники.МестаХранения.StockEnCoursDeRoute);
		СкладОприходования = ?(ДокОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеСписание,Справочники.МестаХранения.StockEnCoursDeRoute,ДокОбъект.МестоХраненияОприходование);
		ТЗТоварыССериями.ЗаполнитьЗначения(СкладСписания, "МестоХранения");
		ДвиженияСформированы = СписатьНоменклатуру(ТЗТоварыССериями, ДокОбъект);	
		Если ДвиженияСформированы Тогда
			ТЗТоварыВНаличии = Движения.ТоварыВНаличии.Выгрузить();
			Для Каждого Стр Из ТЗТоварыВНаличии Цикл
				Движение = Движения.ТоварыВНаличии.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, Стр);
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.МестоХранения = СкладОприходования;
			КонецЦикла;
			ТЗДополнительныеРасходы = Движения.ДополнительныеРасходы.Выгрузить();
			Для Каждого Стр Из ТЗДополнительныеРасходы Цикл
				Движение = Движения.ДополнительныеРасходы.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, Стр);
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.МестоХранения = СкладОприходования;	
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПересортицаТоваров") Тогда	
		ДвиженияСформированы = СписатьНоменклатуру(ТЗТоварыССериями, ДокОбъект);	
		Если ДвиженияСформированы Тогда
			ТЗТоварыВНаличии = Движения.ТоварыВНаличии.Выгрузить();
			Для Каждого Стр Из Движения.ДополнительныеРасходы Цикл
				НС = ТЗТоварыВНаличии.Добавить();
				ЗаполнитьЗначенияСвойств(НС, Стр);
			КонецЦикла;
			ТЗТоварыВНаличии.Свернуть("Номенклатура, Характеристика, Серия", "Количество, Сумма");
			СуммаСписаноВсего = ТЗТоварыВНаличии.Итог("Сумма");
			СуммаОприходованияВсего = 0;
			Для Каждого Стр Из ДокОбъект.ТЧТовары Цикл
				КоличествоОприходование = ?(Стр.КоличествоОприходование > 0, Стр.КоличествоОприходование, Стр.Количество);
				Если Стр.ЦенаОприходование > 0 Тогда
					СуммаОприходование = КоличествоОприходование * Стр.ЦенаОприходование;
					СуммаОприходованияВсего = СуммаОприходованияВсего + СуммаОприходование;
					ДобавитьПриход(Движения, ДокОбъект.Дата, ДокОбъект.МестоХранения, Стр.НоменклатураОприходование, Стр.ХарактеристикаОприходование, Стр.СерияОприходование, ДокОбъект.Ссылка, ДокОбъект.Дата, КоличествоОприходование, СуммаОприходование); 	
				Иначе	
					МасТовары = ТЗТоварыВНаличии.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Серия", Стр.Номенклатура, Стр.Характеристика, Стр.Серия));
					Для Каждого МасСтр Из МасТовары Цикл
						СуммаОприходование = ?(Стр.Количество = МасСтр.Количество, МасСтр.Сумма, Окр(МасСтр.Сумма / МасСтр.Количество * Стр.Количество, 2));
						СуммаОприходованияВсего = СуммаОприходованияВсего + СуммаОприходование;
						ДобавитьПриход(Движения, ДокОбъект.Дата, ДокОбъект.МестоХранения, Стр.НоменклатураОприходование, Стр.ХарактеристикаОприходование, Стр.СерияОприходование, ДокОбъект.Ссылка, ДокОбъект.Дата, КоличествоОприходование, СуммаОприходование);  	
						МасСтр.Количество = МасСтр.Количество - Стр.Количество;
						МасСтр.Сумма = МасСтр.Сумма - СуммаОприходование;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			ДокОбъект.ДополнительныеСвойства.Вставить("Убытки", СуммаСписаноВсего - СуммаОприходованияВсего); // Пробрасываем для формирования движений по регистру "Убытки"
		КонецЕсли;	
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВозвратОтПокупателя") Тогда
		СформироватьОприходованиеПоРеализации(ТЗТоварыССериями, ДокОбъект);
		ДвиженияСформированы = Истина; 
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВозвратОтПокупателяНалоговый") Тогда
		СформироватьОприходованиеПоРеализации(ТЗТоварыССериями, ДокОбъект);
		ДвиженияСформированы = Истина; 
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВозвратПоставщику") Тогда 
		ДвиженияСформированы = СписатьНоменклатуру(ТЗТоварыССериями, ДокОбъект);
		Если ДвиженияСформированы И ЗначениеЗаполнено(ДокОбъект.МестоХранения.ПодчиненныйСклад) 
			И Не ДокОбъект.Контрагент = Справочники.Контрагенты.Migration Тогда
			ТЗТоварыВНаличии = Движения.ТоварыВНаличии.Выгрузить();
			Для Каждого Стр Из ТЗТоварыВНаличии Цикл
				Движение = Движения.ТоварыВНаличии.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, Стр);
				Движение.МестоХранения = ДокОбъект.МестоХранения.ПодчиненныйСклад;
			КонецЦикла;
			ТЗДополнительныеРасходы = Движения.ДополнительныеРасходы.Выгрузить();
			Для Каждого Стр Из ТЗДополнительныеРасходы Цикл
				Движение = Движения.ДополнительныеРасходы.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, Стр);
				Движение.МестоХранения = ДокОбъект.МестоХранения.ПодчиненныйСклад;	
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВозвратПоставщикуНалоговый") Тогда 
		ДвиженияСформированы = СписатьНоменклатуру(ТЗТоварыССериями, ДокОбъект);
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.АктРазбора") Тогда		
		ДвиженияСформированы = СписатьНоменклатуру(ТЗТоварыССериями, ДокОбъект);
		Если ДвиженияСформированы Тогда
			Себестоимость = Движения.ТоварыВНаличии.Итог("Сумма") + Движения.ДополнительныеРасходы.Итог("Сумма");
			СебестоимостьНачислено = 0;
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ВЫБОР
			                      |		КОГДА ТЧТовары.Ссылка.МестоХраненияОприходование <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ПустаяСсылка)
			                      |				И (ТЧТовары.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
			                      |					ИЛИ НЕ ТЧТовары.Характеристика.ДляВнутреннегоИспользования)
			                      |			ТОГДА ТЧТовары.Ссылка.МестоХраненияОприходование
			                      |		ИНАЧЕ ТЧТовары.Ссылка.МестоХранения
			                      |	КОНЕЦ КАК МестоХранения,
			                      |	ТЧТовары.Номенклатура КАК Номенклатура,
			                      |	ТЧТовары.Характеристика КАК Характеристика,
			                      |	ТЧТовары.Серия КАК Серия,
			                      |	ТЧТовары.Количество КАК Количество,
			                      |	ТЧТовары.ДоляСтоимости КАК ДоляСтоимости
			                      |ИЗ
			                      |	Документ.АктРазбора.ТЧТовары КАК ТЧТовары
			                      |ГДЕ
			                      |	ТЧТовары.Ссылка = &Док
			                      |
			                      |УПОРЯДОЧИТЬ ПО
			                      |	ДоляСтоимости");
			Запрос.УстановитьПараметр("Док", ДокОбъект.Ссылка);
			ТЗТовары = Запрос.Выполнить().Выгрузить();	
			ОбщаяДоля = ТЗТовары.Итог("ДоляСтоимости");
			Для А = 1 По ТЗТовары.Количество() Цикл
				Стр = ТЗТовары[А - 1];
				Если Стр.ДоляСтоимости = 0 Тогда 
					Сумма = 0;	
				Иначе	
					Сумма = ?(А = ТЗТовары.Количество(), Себестоимость - СебестоимостьНачислено, Окр(Себестоимость * (Стр.ДоляСтоимости / ОбщаяДоля), 2));
					СебестоимостьНачислено = СебестоимостьНачислено + Сумма;	
				КонецЕсли;	
				ДобавитьПриход(Движения, ДокОбъект.Дата, Стр.МестоХранения, Стр.Номенклатура, Стр.Характеристика, Стр.Серия, ДокОбъект.Ссылка, ДокОбъект.Дата, Стр.Количество, Сумма);	
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если ДвиженияСформированы Тогда
		Если Не Движения.Найти("Хозрасчетный") = Неопределено Тогда 
			РегистрыБухгалтерии.Хозрасчетный.СформироватьДвижения(ДокОбъект);
		КонецЕсли;
	КонецЕсли;
	Возврат ДвиженияСформированы;
КонецФункции
	
Процедура СформироватьОприходованиеПоРеализации(ТЗ, ДокОбъект)
	Движения = ДокОбъект.Движения;
	ВидДвиженияРасход = ВидДвиженияНакопления.Расход;
	Если ЗначениеЗаполнено(ДокОбъект.Основание) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ТоварыВНаличии.МестоХранения КАК МестоХранения,
		                      |	ТоварыВНаличии.Номенклатура КАК Номенклатура,
		                      |	ТоварыВНаличии.Характеристика КАК Характеристика,
		                      |	ТоварыВНаличии.Серия КАК Серия,
		                      |	ТоварыВНаличии.Партия КАК Партия,
		                      |	ТоварыВНаличии.ДатаПартии КАК ДатаПартии,
		                      |	ТоварыВНаличии.Количество КАК Количество,
		                      |	ТоварыВНаличии.Сумма КАК Сумма
		                      |ИЗ
		                      |	РегистрНакопления.ТоварыВНаличии КАК ТоварыВНаличии
		                      |ГДЕ
		                      |	ТоварыВНаличии.Регистратор = &Док
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	Издержки.МестоХранения КАК МестоХранения,
		                      |	Издержки.Номенклатура КАК Номенклатура,
		                      |	Издержки.Характеристика КАК Характеристика,
		                      |	Издержки.Серия КАК Серия,
		                      |	Издержки.Партия КАК Партия,
		                      |	Издержки.СтатьяДДС КАК СтатьяДДС,
		                      |	Издержки.Сумма КАК Сумма
		                      |ИЗ
		                      |	РегистрНакопления.ДополнительныеРасходы КАК Издержки
		                      |ГДЕ
		                      |	Издержки.Регистратор = &Док
		                      |	И Издержки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)");
		Запрос.УстановитьПараметр("Док", ДокОбъект.Основание);
		Рез = Запрос.ВыполнитьПакет();
		ТЗПартииРеализации = Рез[0].Выгрузить();
		ТЗДополнительныеРасходыРеализации = Рез[1].Выгрузить();	
	Иначе
		// Партии реализации 
		ТЗПартииРеализации = Движения.ТоварыВНаличии.Выгрузить();
		ТЗПартииРеализации.Очистить();
		// Издержки реализации
		ТЗДополнительныеРасходыРеализации = Движения.ДополнительныеРасходы.Выгрузить();
		ТЗДополнительныеРасходыРеализации.Очистить();
	КонецЕсли;
	Для Каждого Стр Из ТЗ Цикл
		Отбор = Новый Структура("Номенклатура, Характеристика, Серия", Стр.Номенклатура, Стр.Характеристика, Стр.Серия);
		МасПартии = ТЗПартииРеализации.НайтиСтроки(Отбор);
		КоличествоВсего = Стр.Количество;
		Для Каждого СтрПартия Из МасПартии Цикл
			Количество = ?(КоличествоВсего > СтрПартия.Количество, СтрПартия.Количество, КоличествоВсего);
			Сумма = ?(Количество = СтрПартия.Количество, СтрПартия.Сумма, Окр(СтрПартия.Сумма / СтрПартия.Количество * Количество, 2));
			//Если Сумма = 0 Тогда Продолжить КонецЕсли;
			ДобавитьПриход(Движения, ДокОбъект.Дата, Стр.МестоХранения, Стр.Номенклатура, Стр.Характеристика, Стр.Серия, СтрПартия.Партия, СтрПартия.ДатаПартии, Количество, Сумма); 				
			КоличествоВсего = КоличествоВсего - Количество;
			// Издержки
			Отбор.Вставить("Партия", СтрПартия.Партия);
			МасДополнительныеРасходы = ТЗДополнительныеРасходыРеализации.НайтиСтроки(Отбор);
			Для Каждого СтрДополнительныйРасход Из МасДополнительныеРасходы Цикл
				СуммаИздержки = РассчитатьСуммуСписанияДополнительныхРасходов(Сумма, СтрПартия.Сумма, СтрДополнительныйРасход.Сумма);
				РегистрыНакопления.ДополнительныеРасходы.ДобавитьПриход(Движения, ДокОбъект.Дата, СтрДополнительныйРасход.МестоХранения, СтрДополнительныйРасход.Номенклатура, СтрДополнительныйРасход.Характеристика, СтрДополнительныйРасход.Серия, СтрДополнительныйРасход.Партия, СтрДополнительныйРасход.СтатьяДДС, СуммаИздержки);
				СтрДополнительныйРасход.Сумма = СтрДополнительныйРасход.Сумма - СуммаИздержки;
			КонецЦикла;
		КонецЦикла;
		Если КоличествоВсего > 0 Тогда
			Сумма = Окр(Стр.Сумма / Стр.Количество * КоличествоВсего, 2);
			ДобавитьПриход(Движения, ДокОбъект.Дата, Стр.МестоХранения, Стр.Номенклатура, Стр.Характеристика, Стр.Серия, ДокОбъект.Ссылка, ДокОбъект.Дата, КоличествоВсего, Сумма);
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

Процедура СформироватьОприходованиеПоВыпускуПродукции(ДокОбъект)
	Движения = ДокОбъект.Движения;
	ТЗПартии = Движения.ТоварыВНаличии.Выгрузить();
	ТЗДополнительныеРасходы = Движения.ДополнительныеРасходы.Выгрузить();	
	ТЗТовары = ДокОбъект.ТЧТовары.Выгрузить();
	//
	ТЗИнгредиенты = ДокОбъект.ТЧИнгредиенты.Выгрузить();
	ДокументПартии = ДокОбъект.Ссылка;
	//
	Для Каждого Стр Из ДокОбъект.ТЧТовары Цикл
		СуммаИтог = 0;
		МасИнгредиенты = ТЗИнгредиенты.НайтиСтроки(Новый Структура("КодСтрокиТовар", Стр.КодСтроки));
		Для Каждого МасСтр Из МасИнгредиенты Цикл
			Нужно = МасСтр.Количество;
			МасПартии = ТЗПартии.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Серия", МасСтр.Номенклатура, МасСтр.Характеристика, МасСтр.Серия));
			Для Каждого СтрПартия Из МасПартии Цикл
				Если СтрПартия.Количество = 0 Или Нужно = 0 Тогда Продолжить КонецЕсли;
				Количество = ?(Нужно > СтрПартия.Количество, СтрПартия.Количество, Нужно);
				СуммаПартии = ?(Количество = СтрПартия.Количество, СтрПартия.Сумма, Окр(СтрПартия.Сумма / СтрПартия.Количество * Количество, 2)); 												
				МасДополнительныеРасходы = ТЗДополнительныеРасходы.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Серия, Партия", СтрПартия.Номенклатура, СтрПартия.Характеристика, СтрПартия.Серия, СтрПартия.Партия));
				Для Каждого СтрДополнительныйРасход Из МасДополнительныеРасходы Цикл
					Если СтрДополнительныйРасход.Сумма = 0 Тогда Продолжить КонецЕсли;
					СуммаИздержки = РассчитатьСуммуСписанияДополнительныхРасходов(СуммаПартии, СтрПартия.Сумма, СтрДополнительныйРасход.Сумма);
					СтрДополнительныйРасход.Сумма = СтрДополнительныйРасход.Сумма - СуммаИздержки;
					СуммаИтог = СуммаИтог + СуммаИздержки;
				КонецЦикла;
				СтрПартия.Количество = СтрПартия.Количество - Количество;
				СтрПартия.Сумма = СтрПартия.Сумма - СуммаПартии;
				СуммаИтог = СуммаИтог + СуммаПартии;
				Нужно = Нужно - Количество;
			КонецЦикла;	
		КонецЦикла;
		ДобавитьПриход(Движения, ДокОбъект.Дата, ДокОбъект.МестоХраненияОприходование, Стр.Номенклатура, Стр.Характеристика, Стр.Серия, ДокументПартии, ДокОбъект.Дата, Стр.Количество, СуммаИтог);
	КонецЦикла;	
КонецПроцедуры	

Функция СписатьНоменклатуру(ТЗ, ДокОбъект, РазрешитьНедостачи = Ложь)
	// Получаем остатки
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЫРАЗИТЬ(ТЗ.МестоХранения КАК Справочник.МестаХранения) КАК МестоХранения,
	                      |	ВЫРАЗИТЬ(ТЗ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	                      |	ВЫРАЗИТЬ(ТЗ.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	                      |	ВЫРАЗИТЬ(ТЗ.Серия КАК Справочник.СерииНоменклатуры) КАК Серия,
	                      |	ВЫРАЗИТЬ(ТЗ.Количество КАК ЧИСЛО) КАК Количество
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	&ТЗ КАК ТЗ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ.МестоХранения КАК МестоХранения,
	                      |	ВТ.Номенклатура КАК Номенклатура,
	                      |	ВТ.Характеристика КАК Характеристика,
	                      |	ВТ.Серия КАК Серия,
	                      |	СУММА(ВТ.Количество) КАК Количество
	                      |ПОМЕСТИТЬ ВТТовары
	                      |ИЗ
	                      |	ВТ КАК ВТ
	                      |ГДЕ
	                      |	НЕ ВТ.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТ.МестоХранения,
	                      |	ВТ.Номенклатура,
	                      |	ВТ.Характеристика,
	                      |	ВТ.Серия
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТТовары.МестоХранения КАК МестоХранения,
	                      |	ВТТовары.Номенклатура КАК Номенклатура,
	                      |	ВТТовары.Характеристика КАК Характеристика,
	                      |	ВТТовары.Серия КАК Серия,
	                      |	ЕСТЬNULL(ТоварыВНаличииОстатки.Партия, НЕОПРЕДЕЛЕНО) КАК Партия,
	                      |	ЕСТЬNULL(ТоварыВНаличииОстатки.ДатаПартии, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПартии,
	                      |	ВТТовары.Количество КАК Количество,
	                      |	ЕСТЬNULL(ТоварыВНаличииОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	                      |	ЕСТЬNULL(ТоварыВНаличииОстатки.СуммаОстаток, 0) КАК СуммаОстаток
	                      |ПОМЕСТИТЬ ВТТоварыВНаличии
	                      |ИЗ
	                      |	ВТТовары КАК ВТТовары
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВНаличии.Остатки(&ДатаОстатков, ) КАК ТоварыВНаличииОстатки
	                      |		ПО ВТТовары.МестоХранения = ТоварыВНаличииОстатки.МестоХранения
	                      |			И ВТТовары.Номенклатура = ТоварыВНаличииОстатки.Номенклатура
	                      |			И ВТТовары.Характеристика = ТоварыВНаличииОстатки.Характеристика
	                      |			И ВТТовары.Серия = ТоварыВНаличииОстатки.Серия
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТТовары.МестоХранения КАК МестоХранения,
	                      |	ВТТовары.Номенклатура КАК Номенклатура,
	                      |	ВТТовары.Характеристика КАК Характеристика,
	                      |	ВТТовары.Серия КАК Серия,
	                      |	ВТТовары.Количество КАК Количество
	                      |ИЗ
	                      |	ВТТовары КАК ВТТовары
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВЗ.Номенклатура КАК Номенклатура,
	                      |	ВЗ.Характеристика КАК Характеристика,
	                      |	ВЗ.Серия КАК Серия,
	                      |	ВЗ.Количество КАК Количество,
	                      |	ВЗ.КоличествоОстаток КАК КоличествоОстаток,
	                      |	ВЗ.Количество <= ВЗ.КоличествоОстаток КАК МожноСписать
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ВТТоварыВНаличии.Номенклатура КАК Номенклатура,
	                      |		ВТТоварыВНаличии.Характеристика КАК Характеристика,
	                      |		ВТТоварыВНаличии.Серия КАК Серия,
	                      |		ВТТоварыВНаличии.Количество КАК Количество,
	                      |		СУММА(ВТТоварыВНаличии.КоличествоОстаток) КАК КоличествоОстаток
	                      |	ИЗ
	                      |		ВТТоварыВНаличии КАК ВТТоварыВНаличии
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		ВТТоварыВНаличии.Номенклатура,
	                      |		ВТТоварыВНаличии.Характеристика,
	                      |		ВТТоварыВНаличии.Количество,
	                      |		ВТТоварыВНаличии.Серия) КАК ВЗ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТТоварыВНаличии.МестоХранения КАК МестоХранения,
	                      |	ВТТоварыВНаличии.Номенклатура КАК Номенклатура,
	                      |	ВТТоварыВНаличии.Характеристика КАК Характеристика,
	                      |	ВТТоварыВНаличии.Серия КАК Серия,
	                      |	ВТТоварыВНаличии.Партия КАК Партия,
	                      |	ВТТоварыВНаличии.ДатаПартии КАК ДатаПартии,
	                      |	ВТТоварыВНаличии.КоличествоОстаток КАК Количество,
	                      |	ВТТоварыВНаличии.СуммаОстаток КАК Сумма
	                      |ИЗ
	                      |	ВТТоварыВНаличии КАК ВТТоварыВНаличии
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДатаПартии
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТТоварыВНаличии.МестоХранения КАК МестоХранения,
	                      |	ВТТоварыВНаличии.Номенклатура КАК Номенклатура,
	                      |	ВТТоварыВНаличии.Характеристика КАК Характеристика,
	                      |	ВТТоварыВНаличии.Серия КАК Серия,
	                      |	ВТТоварыВНаличии.Партия КАК Партия,
	                      |	ДополнительныеРасходыОстатки.СтатьяДДС КАК СтатьяДДС,
	                      |	ДополнительныеРасходыОстатки.СуммаОстаток КАК Сумма
	                      |ИЗ
	                      |	ВТТоварыВНаличии КАК ВТТоварыВНаличии
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДополнительныеРасходы.Остатки(&ДатаОстатков, ) КАК ДополнительныеРасходыОстатки
	                      |		ПО ВТТоварыВНаличии.МестоХранения = ДополнительныеРасходыОстатки.МестоХранения
	                      |			И ВТТоварыВНаличии.Номенклатура = ДополнительныеРасходыОстатки.Номенклатура
	                      |			И ВТТоварыВНаличии.Характеристика = ДополнительныеРасходыОстатки.Характеристика
	                      |			И ВТТоварыВНаличии.Серия = ДополнительныеРасходыОстатки.Серия
	                      |			И ВТТоварыВНаличии.Партия = ДополнительныеРасходыОстатки.Партия");
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	Запрос.УстановитьПараметр("ДатаОстатков", Новый Граница(ДокОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Период", ДокОбъект.Дата);
	Результат = Запрос.ВыполнитьПакет();
	// Получаем данные
	ТЗТовары = Результат[3].Выгрузить();
	ТЗКонтрольОстатков = Результат[4].Выгрузить();
	ТЗТоварыВНаличии = Результат[5].Выгрузить();
	ТЗДополнительныеРасходы = Результат[6].Выгрузить();
   	// Проверяем возможность списания
	ТекстОшибкиСписания = "";
	ЭтоИнтерфейсПродавца = ДокОбъект.ДополнительныеСвойства.Свойство("ЭтоИнтерфейсПродавца");
	Если Не РазрешитьНедостачи Тогда
		ТЗКонтрольОстатков = Результат[4].Выгрузить();
		Мас = ТЗКонтрольОстатков.НайтиСтроки(Новый Структура("МожноСписать", Ложь));
		Если Мас.Количество() > 0 Тогда			
			Для Каждого Стр Из Мас Цикл
				//Если ЭтоИнтерфейсПродавца Тогда
				//	ТекстОшибки = Нстр("fr = 'Erreur ('; ru = 'Ошибка ('; en = 'Error ('; es = 'Error ('") + ОбщегоНазначенияКлиентСервер.ПредставлениеНоменклатуры(Стр.Номенклатура, Стр.Характеристика, Стр.Серия) + 
				//			Нстр("fr = ""); contacter l'administrateur!""; ru = '); обратитесь к администратору!'; en = '); contact the administrator!'; es = '); ¡póngase en contacto con el administrador!'");
				//Иначе
					ТекстОшибки = Нстр("fr = 'Pas suffisant ('; ru = 'Недостаточно ('; en = 'Not enough ('; es = 'No es suficiente ('") + ОбщегоНазначенияКлиентСервер.ПредставлениеНоменклатуры(Стр.Номенклатура, Стр.Характеристика, Стр.Серия) + 
							Нстр("ru = ') Нужно: '; fr = ') Requis: '") + СокрЛП(Стр.Количество) + 
							Нстр("ru = '; остаток: '; fr = '; reste: '") + СокрЛП(Стр.КоличествоОстаток);
				//КонецЕсли;
				ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(ТекстОшибкиСписания, ТекстОшибки, "; " + Символы.ВК); 
			КонецЦикла;
			Если ОбщегоНазначенияПовтИсп.ЭтоФоновоеЗадание() или ДокОбъект.ДополнительныеСвойства.Свойство("ЭтоИнтерфейсПродавца") Тогда
				ДокОбъект.ДополнительныеСвойства.Вставить("ТекстОшибки", ТекстОшибкиСписания);	
			Иначе	
				Сообщить(ТекстОшибкиСписания);
			КонецЕсли;
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;	
	// Списываем партии
	Для Каждого Стр Из ТЗТовары Цикл
		КоличествоКСписанию = Стр.Количество;		
		// 
		Если РазрешитьНедостачи Тогда // Списываем только то количество, которое есть на остатках 
			Мас = ТЗКонтрольОстатков.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Серия, МожноСписать", Стр.Номенклатура, Стр.Характеристика, Стр.Серия, Ложь));
			Если Мас.Количество() > 0 Тогда
				КоличествоКСписанию = ?(Мас[0].КоличествоОстаток <= 0, 0, Мас[0].КоличествоОстаток);
				КоличествоНедостача = Стр.Количество - КоличествоКСписанию;
				ДобавитьНедостачу(ДокОбъект.Движения, ДокОбъект.Дата, ДокОбъект.МестоХранения, Стр.Номенклатура, Стр.Характеристика, Стр.Серия, КоличествоНедостача);
				//Если ЭтоИнтерфейсПродавца Тогда
				//	ТекстОшибки = Нстр("fr = 'Erreur ('; ru = 'Ошибка ('; en = 'Error ('; es = 'Error ('") + ОбщегоНазначенияКлиентСервер.ПредставлениеНоменклатуры(Стр.Номенклатура, Стр.Характеристика, Стр.Серия) + 
				//			Нстр("fr = ""); contacter l'administrateur!""; ru = '); обратитесь к администратору!'; en = '); contact the administrator!'; es = '); ¡póngase en contacto con el administrador!'");
				//иначе
					ТекстОшибки = Нстр("fr = 'Pas suffisant ('; ru = 'Недостаточно ('; en = 'Not enough ('; es = 'No es suficiente ('") + ОбщегоНазначенияКлиентСервер.ПредставлениеНоменклатуры(Стр.Номенклатура, Стр.Характеристика, Стр.Серия) + 
							Нстр("ru = ') Нужно: '; fr = ') Requis: '") + СокрЛП(Стр.Количество) + 
							Нстр("ru = '; остаток: '; fr = '; reste: '") + СокрЛП(КоличествоКСписанию);
				//КонецЕсли;
				ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(ТекстОшибкиСписания, ТекстОшибки, "; " + Символы.ВК);
				Если КоличествоКСписанию = 0 Тогда Продолжить КонецЕсли;
			КонецЕсли;			
		КонецЕсли;
		//
		Отбор = Новый Структура("Номенклатура, Характеристика, Серия", Стр.Номенклатура, Стр.Характеристика, Стр.Серия);
		МасПартии = ТЗТоварыВНаличии.НайтиСтроки(Отбор);
		Для Каждого СтрПартия Из МасПартии Цикл
			Если СтрПартия.Количество <= 0 Тогда Продолжить КонецЕсли; // Чтоб не списать минусовую или нулевую партию
			Если КоличествоКСписанию = 0 Тогда Прервать КонецЕсли; // Если всё списали, тогда выходим
			Количество = ?(КоличествоКСписанию < СтрПартия.Количество, КоличествоКСписанию, СтрПартия.Количество);		
			Сумма = ?(Количество = СтрПартия.Количество, СтрПартия.Сумма, Окр(СтрПартия.Сумма / СтрПартия.Количество * Количество, 2));
			// Списываем издержки
			МасДополнительныеРасходы = ТЗДополнительныеРасходы.НайтиСтроки(Новый Структура("Номенклатура, Характеристика, Серия, Партия", СтрПартия.Номенклатура, СтрПартия.Характеристика, СтрПартия.Серия, СтрПартия.Партия));
			Для Каждого СтрДополнительныйРасход Из МасДополнительныеРасходы Цикл
				СуммаДополнительногоРасхода = РассчитатьСуммуСписанияДополнительныхРасходов(Сумма, СтрПартия.Сумма, СтрДополнительныйРасход.Сумма);
				РегистрыНакопления.ДополнительныеРасходы.ДобавитьРасход(ДокОбъект.Движения, ДокОбъект.Дата, СтрДополнительныйРасход.МестоХранения, СтрПартия.Номенклатура, СтрПартия.Характеристика, СтрПартия.Серия, СтрПартия.Партия, СтрДополнительныйРасход.СтатьяДДС, СуммаДополнительногоРасхода);
				СтрДополнительныйРасход.Сумма = СтрДополнительныйРасход.Сумма - СуммаДополнительногоРасхода;
			КонецЦикла;		
			// Списываем партии
			ДобавитьРасход(ДокОбъект.Движения, ДокОбъект.Дата, СтрПартия.МестоХранения, СтрПартия.Номенклатура, СтрПартия.Характеристика, СтрПартия.Серия, СтрПартия.Партия, СтрПартия.ДатаПартии, Количество, Сумма);
			// Уменьшаем данные
			КоличествоКСписанию = КоличествоКСписанию - Количество;
			СтрПартия.Количество = СтрПартия.Количество - Количество;
			СтрПартия.Сумма = СтрПартия.Сумма - Сумма;
		КонецЦикла;		
	КонецЦикла;
	Если Не ПустаяСтрока(ТекстОшибкиСписания) Тогда
		Если ОбщегоНазначенияПовтИсп.ЭтоФоновоеЗадание() Тогда
			ДокОбъект.ДополнительныеСвойства.Вставить("ТекстОшибки", ТекстОшибкиСписания);
		ИначеЕсли ЭтоИнтерфейсПродавца Тогда 
			ДокОбъект.ДополнительныеСвойства.Вставить("ТекстОшибки", ТекстОшибкиСписания);
		Иначе	
			Сообщить(ТекстОшибкиСписания);
		КонецЕсли;	
	КонецЕсли;	
	Возврат Истина;
КонецФункции

Процедура ДобавитьПриход(Движения, ДатаДвижения, МестоХранения, Номенклатура, Характеристика, Серия, Партия, ДатаПартии, Количество, Сумма)
	НС = Движения.ТоварыВНаличии.ДобавитьПриход();
	НС.Период = ДатаДвижения;
	НС.МестоХранения = МестоХранения;
	НС.Номенклатура = Номенклатура;
	НС.Характеристика = Характеристика;
	НС.Серия = Серия;
	НС.Партия = Партия;
	НС.ДатаПартии = ДатаПартии;
	НС.Количество = Количество;
	НС.Сумма = Сумма;
КонецПроцедуры

Процедура ДобавитьРасход(Движения, ДатаДвижения, МестоХранения, Номенклатура, Характеристика, Серия, Партия, ДатаПартии, Количество, Сумма)
	НС = Движения.ТоварыВНаличии.ДобавитьРасход();
	НС.Период = ДатаДвижения;
	НС.МестоХранения = МестоХранения;
	НС.Номенклатура = Номенклатура;
	НС.Характеристика = Характеристика;
	НС.Серия = Серия;
	НС.Партия = Партия;
	НС.ДатаПартии = ДатаПартии;
	НС.Количество = Количество;
	НС.Сумма = Сумма;
КонецПроцедуры

Процедура ДобавитьНедостачу(Движения, ДатаДвижения, МестоХранения, Номенклатура, Характеристика, Серия, Количество)
	НС = Движения.ТоварыНедостача.Добавить();
	НС.Период = ДатаДвижения;
	НС.МестоХранения = МестоХранения;
	НС.Номенклатура = Номенклатура;
	НС.Характеристика = Характеристика;
	НС.Серия = Серия;
	НС.Количество = Количество;
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

Процедура ДобавитьДанныеОприходования(ТЗТоварыССериями, ДокОбъект)
	ТЗТоварыССериями.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата")); 
	ТЗТоварыССериями.Колонки.Добавить("ВидДвижения", Новый ОписаниеТипов("ВидДвиженияНакопления"));
	ТЗТоварыССериями.Колонки.Добавить("Партия", Метаданные.ОпределяемыеТипы.ПриходныйДокументПартии.Тип);
	ТЗТоварыССериями.Колонки.Добавить("ДатаПартии", Новый ОписаниеТипов("Дата"));
	ТЗТоварыССериями.ЗаполнитьЗначения(ДокОбъект.Дата, "Период");
	ТЗТоварыССериями.ЗаполнитьЗначения(ВидДвиженияНакопления.Приход, "ВидДвижения");
	ТЗТоварыССериями.ЗаполнитьЗначения(ДокОбъект.Ссылка, "Партия");
	ТЗТоварыССериями.ЗаполнитьЗначения(ДокОбъект.Дата, "ДатаПартии");
	Партия = ДокОбъект.Ссылка;
	ТЗТоварыССериями.ЗаполнитьЗначения(Партия, "Партия");
КонецПроцедуры	

Функция СформироватьТаблицуКритическихОстатков(Период, ОтчётныйПериод, ТолькоКритические) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЗ.Товар КАК Товар,
	                      |	ВЗ.ОтгруженоЗаПериод / &ОтчётныйПериод КАК СуточнаяПотребность,
	                      |	ВЗ.ОтгруженоЗаПериод КАК ОтгруженоЗаПериод,
	                      |	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0)) КАК Остаток,
	                      |	ВЫБОР
	                      |		КОГДА ВЗ.Товар.МинимальныйЗапас = 0
	                      |			ТОГДА 3
	                      |		ИНАЧЕ ВЗ.Товар.МинимальныйЗапас
	                      |	КОНЕЦ КАК МинимальныйЗапас,
	                      |	ВЗ.Заказано КАК Заказано,
	                      |	ВЗ.ЗаказаноКлиентами КАК ЗаказаноКлиентами
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ВЗ.Товар КАК Товар,
	                      |		СУММА(ВЗ.ОтгруженоЗаПериод) КАК ОтгруженоЗаПериод,
	                      |		СУММА(ВЗ.Заказано) КАК Заказано,
	                      |		СУММА(ВЗ.ЗаказаноКлиентами) КАК ЗаказаноКлиентами
	                      |	ИЗ
	                      |		(ВЫБРАТЬ
	                      |			ТоварыНаСкладах.Товар КАК Товар,
	                      |			ВЫБОР
	                      |				КОГДА ТоварыНаСкладах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                      |					ТОГДА ТоварыНаСкладах.Количество
	                      |				ИНАЧЕ -ТоварыНаСкладах.Количество
	                      |			КОНЕЦ КАК ОтгруженоЗаПериод,
	                      |			0 КАК Заказано,
	                      |			0 КАК ЗаказаноКлиентами
	                      |		ИЗ
	                      |			РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
	                      |		ГДЕ
	                      |			ТоварыНаСкладах.Период МЕЖДУ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Период, ДЕНЬ), ДЕНЬ, -&ОтчётныйПериод) И ДОБАВИТЬКДАТЕ(&Период, ДЕНЬ, -1)
	                      |			И (ТоварыНаСкладах.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	                      |					ИЛИ ТоварыНаСкладах.Регистратор ССЫЛКА Документ.ВозвратПокупателя
	                      |					ИЛИ ТоварыНаСкладах.Регистратор ССЫЛКА Документ.СписаниеПродуктовДляСотрудников)
	                      |		
	                      |		ОБЪЕДИНИТЬ ВСЕ
	                      |		
	                      |		
	                      |		ВЫБРАТЬ
	                      |			ОбъёмыЗакупокСрезПоследних.Номенклатура,
	                      |			0,
	                      |			ОбъёмыЗакупокСрезПоследних.Количество,
	                      |			0
	                      |		ИЗ
	                      |			РегистрСведений.ОбъёмыЗакупок.СрезПоследних(
	                      |					,
	                      |					ДатаПрихода МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И ДОБАВИТЬКДАТЕ(&Период, ДЕНЬ, ВЫБОР
	                      |							КОГДА Номенклатура.МинимальныйЗапас = 0
	                      |								ТОГДА 3
	                      |							ИНАЧЕ Номенклатура.МинимальныйЗапас
	                      |						КОНЕЦ)) КАК ОбъёмыЗакупокСрезПоследних
	                      |		
	                      |		ОБЪЕДИНИТЬ ВСЕ
	                      |		
	                      |		ВЫБРАТЬ
	                      |			ЗаказТовары.Товар,
	                      |			0,
	                      |			0,
	                      |			ЗаказТовары.Количество
	                      |		ИЗ
	                      |			Документ.Заказ.Товары КАК ЗаказТовары
	                      |		ГДЕ
	                      |			ЗаказТовары.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)
	                      |			И ЗаказТовары.Ссылка.ПометкаУдаления = ЛОЖЬ) КАК ВЗ
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		ВЗ.Товар) КАК ВЗ
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&Период, Качество В (&Качество)) КАК ТоварыНаСкладахОстатки
	                      |		ПО ВЗ.Товар = ТоварыНаСкладахОстатки.Товар
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВЗ.Товар,
	                      |	ВЗ.ОтгруженоЗаПериод / &ОтчётныйПериод,
	                      |	ВЗ.ОтгруженоЗаПериод,
	                      |	ВЫБОР
	                      |		КОГДА ВЗ.Товар.МинимальныйЗапас = 0
	                      |			ТОГДА 3
	                      |		ИНАЧЕ ВЗ.Товар.МинимальныйЗапас
	                      |	КОНЕЦ,
	                      |	ВЗ.Заказано,
	                      |	ВЗ.ЗаказаноКлиентами
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВЗ.Товар КАК Товар,
	                      |	ВЗ.Единица КАК Единица,
	                      |	ВЗ.СуточнаяПотребность КАК СуточнаяПотребность,
	                      |	ВЗ.МинимальныйОстаток КАК МинимальныйОстаток,
	                      |	ВЗ.Остаток КАК Остаток,
	                      |	ВЗ.Запас КАК Запас,
	                      |	ВЗ.МинимальныйЗапас КАК МинимальныйЗапас,
	                      |	ВЗ.Заказано КАК Заказано,
	                      |	ВЗ.ЗаказаноКлиентами КАК ЗаказаноКлиентами,
	                      |	ВЫБОР
	                      |		КОГДА ВЗ.ОсноваРасчёта - ВЗ.Остаток < 0
	                      |			ТОГДА 0
	                      |		ИНАЧЕ ВЗ.ОсноваРасчёта - ВЗ.Остаток
	                      |	КОНЕЦ КАК КЗакупке
	                      |ПОМЕСТИТЬ ВТИтог
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ВТ.Товар КАК Товар,
	                      |		ВТ.Товар.ОсновнаяЕдиница КАК Единица,
	                      |		ВТ.СуточнаяПотребность КАК СуточнаяПотребность,
	                      |		ВТ.СуточнаяПотребность * ВТ.МинимальныйЗапас КАК МинимальныйОстаток,
	                      |		ВТ.Остаток КАК Остаток,
	                      |		ВТ.Остаток / ВЫБОР
	                      |			КОГДА ВТ.СуточнаяПотребность = 0
	                      |				ТОГДА 1
	                      |			ИНАЧЕ ВТ.СуточнаяПотребность
	                      |		КОНЕЦ КАК Запас,
	                      |		ВТ.МинимальныйЗапас КАК МинимальныйЗапас,
	                      |		ВТ.Заказано КАК Заказано,
	                      |		ВТ.ЗаказаноКлиентами КАК ЗаказаноКлиентами,
	                      |		ВЫБОР
	                      |			КОГДА ВТ.СуточнаяПотребность * ВТ.МинимальныйЗапас > ВТ.Заказано + ВТ.ЗаказаноКлиентами
	                      |				ТОГДА ВТ.СуточнаяПотребность * ВТ.МинимальныйЗапас
	                      |			ИНАЧЕ ВТ.Заказано + ВТ.ЗаказаноКлиентами
	                      |		КОНЕЦ КАК ОсноваРасчёта
	                      |	ИЗ
	                      |		ВТ КАК ВТ) КАК ВЗ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТИтог.Товар КАК Товар,
	                      |	ВТИтог.Единица КАК Единица,
	                      |	ВТИтог.СуточнаяПотребность КАК СуточнаяПотребность,
	                      |	ВТИтог.МинимальныйОстаток КАК МинимальныйОстаток,
	                      |	ВТИтог.Остаток КАК Остаток,
	                      |	ВТИтог.Запас КАК Запас,
	                      |	ВТИтог.МинимальныйЗапас КАК МинимальныйЗапас,
	                      |	ВТИтог.Заказано КАК Заказано,
	                      |	ВТИтог.ЗаказаноКлиентами КАК ЗаказаноКлиентами,
	                      |	ВТИтог.КЗакупке КАК КЗакупке
	                      |ИЗ
	                      |	ВТИтог КАК ВТИтог
	                      |ГДЕ
	                      |	ВЫБОР
	                      |			КОГДА &ТолькоКритические
	                      |				ТОГДА ВТИтог.КЗакупке > 0
	                      |			ИНАЧЕ ИСТИНА
	                      |		КОНЕЦ");
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ОтчётныйПериод", ОтчётныйПериод); 
	Запрос.УстановитьПараметр("ТолькоКритические", ТолькоКритические);
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции	

Функция РассчитатьСуммуСписанияДополнительныхРасходов(СуммаСписания, СуммаПартии, СуммаДополнительногоРасхода)
	Возврат ?(СуммаСписания = СуммаПартии, СуммаДополнительногоРасхода, Окр(СуммаДополнительногоРасхода / СуммаПартии * СуммаСписания, 2))	
КонецФункции

Функция ПолучитьТоварыПоОрдеруИзОснований(Основание)
	МасОснований = Новый Массив;
	тзВремТоварыКРазмещению = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент().ТЧТовары.Выгрузить();
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		МасОснований.Добавить(Основание);
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаданиеНаПеревозку") Тогда
		МасОснований = Основание.ТЧНакладные.ВыгрузитьКолонку("Накладная");
	КонецЕсли;
	Если МасОснований.Количество() = 0 тогда
		Возврат тзВремТоварыКРазмещению;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Ссылка В(&МасОснований)";
	Запрос.УстановитьПараметр("МасОснований",МасОснований);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТЗТоварыССериями = СерииИРазмещение.ОбъединитьТоварыССериями(Выборка.Ссылка);
		Для Каждого Стр из ТЗТоварыССериями Цикл 
			НС = тзВремТоварыКРазмещению.Добавить();
			ЗаполнитьЗначенияСвойств(НС,Стр);
		КонецЦикла;
	КонецЦикла;
	тзВремТоварыКРазмещению.Свернуть("Номенклатура,Характеристика,Серия","Количество,СуммаСНДС");
	Возврат тзВремТоварыКРазмещению;
КонецФункции

Функция ПолучитьДопРасходыПоОрдеруИзОснований(Основание)
	МасОснований = Новый Массив;
	тзВремТоварыКРазмещению = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент().ТЧДополнительныеРасходы.Выгрузить();
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		МасОснований.Добавить(Основание);
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаданиеНаПеревозку") Тогда
		МасОснований = Основание.ТЧНакладные.ВыгрузитьКолонку("Накладная");
		Для Каждого Стр из Основание.ТЧДополнительныеРасходы Цикл 
			НС = тзВремТоварыКРазмещению.Добавить();
			ЗаполнитьЗначенияСвойств(НС,Стр);
		КонецЦикла;
	КонецЕсли;
	Если МасОснований.Количество() = 0 тогда
		Возврат тзВремТоварыКРазмещению;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТЧДополнительныеРасходы.Номенклатура КАК Номенклатура,
	|	ПоступлениеТоваровУслугТЧДополнительныеРасходы.Характеристика КАК Характеристика,
	|	ПоступлениеТоваровУслугТЧДополнительныеРасходы.СтатьяДДС КАК СтатьяДДС,
	|	СУММА(ПоступлениеТоваровУслугТЧДополнительныеРасходы.Сумма) КАК Сумма
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.ТЧДополнительныеРасходы КАК ПоступлениеТоваровУслугТЧДополнительныеРасходы
	|ГДЕ
	|	ПоступлениеТоваровУслугТЧДополнительныеРасходы.Ссылка В(&МасОснований)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТЧДополнительныеРасходы.Номенклатура,
	|	ПоступлениеТоваровУслугТЧДополнительныеРасходы.Ссылка,
	|	ПоступлениеТоваровУслугТЧДополнительныеРасходы.СтатьяДДС,
	|	ПоступлениеТоваровУслугТЧДополнительныеРасходы.Характеристика";
	Запрос.УстановитьПараметр("МасОснований",МасОснований);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НС = тзВремТоварыКРазмещению.Добавить();
		ЗаполнитьЗначенияСвойств(НС,Выборка);
	КонецЦикла;
	тзВремТоварыКРазмещению.Свернуть("Номенклатура,Характеристика,СтатьяДДС","Сумма");
	Возврат тзВремТоварыКРазмещению;
КонецФункции

#КонецОбласти

#Область Остатки

Функция ПолучитьСреднююЦенуПоОстаткам(Номенклатура, Характеристики, ДатаСреза) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЗ.Номенклатура КАК Номенклатура,
	                      |	ВЗ.Характеристика КАК Характеристика,
	                      |	ВЫБОР
	                      |		КОГДА ВЗ.Количество = 0
	                      |			ТОГДА 0
	                      |		ИНАЧЕ ВЫРАЗИТЬ(ВЗ.Сумма / ВЗ.Количество КАК ЧИСЛО(12, 2))
	                      |	КОНЕЦ КАК Цена
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ВЗ.Номенклатура КАК Номенклатура,
	                      |		ВЗ.Характеристика КАК Характеристика,
	                      |		СУММА(ВЗ.Количество) КАК Количество,
	                      |		СУММА(ВЗ.Сумма) КАК Сумма
	                      |	ИЗ
	                      |		(ВЫБРАТЬ
	                      |			ТоварыВНаличииОстатки.Номенклатура КАК Номенклатура,
	                      |			ТоварыВНаличииОстатки.Характеристика КАК Характеристика,
	                      |			ТоварыВНаличииОстатки.КоличествоОстаток КАК Количество,
	                      |			ТоварыВНаличииОстатки.СуммаОстаток КАК Сумма
	                      |		ИЗ
	                      |			РегистрНакопления.ТоварыВНаличии.Остатки(
	                      |					&ДатаСреза,
	                      |					Номенклатура В (&Номенклатура)
	                      |						И Характеристика В (&Характеристики)) КАК ТоварыВНаличииОстатки
	                      |		
	                      |		ОБЪЕДИНИТЬ ВСЕ
	                      |		
	                      |		ВЫБРАТЬ
	                      |			ДополнительныеРасходы.Номенклатура,
	                      |			ДополнительныеРасходы.Характеристика,
	                      |			0,
	                      |			ДополнительныеРасходы.СуммаОстаток
	                      |		ИЗ
	                      |			РегистрНакопления.ДополнительныеРасходы.Остатки(
	                      |					&ДатаСреза,
	                      |					Номенклатура В (&Номенклатура)
	                      |						И Характеристика В (&Характеристики)) КАК ДополнительныеРасходы) КАК ВЗ
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		ВЗ.Номенклатура,
	                      |		ВЗ.Характеристика) КАК ВЗ");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристики", Характеристики);
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьСреднююЦенуПоПоступлениям(Организация, Номенклатура, Характеристики, НачалоПериода, КонецПериода) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЗ.Номенклатура КАК Номенклатура,
	                      |	ВЗ.Характеристика КАК Характеристика,
	                      |	ВЫБОР
	                      |		КОГДА ВЗ.Количество = 0
	                      |			ТОГДА 0
	                      |		ИНАЧЕ ВЫРАЗИТЬ(ВЗ.Сумма / ВЗ.Количество КАК ЧИСЛО(12, 2))
	                      |	КОНЕЦ КАК Цена
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ТоварыВНаличииОбороты.Номенклатура КАК Номенклатура,
	                      |		ТоварыВНаличииОбороты.Характеристика КАК Характеристика,
	                      |		СУММА(ТоварыВНаличииОбороты.КоличествоПриход) КАК Количество,
	                      |		СУММА(ТоварыВНаличииОбороты.СуммаПриход) КАК Сумма
	                      |	ИЗ
	                      |		РегистрНакопления.ТоварыВНаличии.Обороты(
	                      |				&НачалоПериода,
	                      |				&КонецПериода,
	                      |				Регистратор,
	                      |				Организация = &Организация
	                      |					И Номенклатура В (&Номенклатура)
	                      |					И Характеристика В (&Характеристики)) КАК ТоварыВНаличииОбороты
	                      |	ГДЕ
	                      |		ТоварыВНаличииОбороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		ТоварыВНаличииОбороты.Номенклатура,
	                      |		ТоварыВНаличииОбороты.Характеристика) КАК ВЗ");
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристики", Характеристики);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции

Функция ПолучитьСебестоимостьПоДокументу(Док) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЗ.ВидДвижения КАК ВидДвижения,
	                      |	ВЗ.Номенклатура КАК Номенклатура,
	                      |	ВЗ.Характеристика КАК Характеристика,
	                      |	ВЗ.Серия КАК Серия,
	                      |	СУММА(ВЗ.Количество) КАК Количество,
	                      |	СУММА(ВЗ.Сумма) КАК Сумма
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ТоварыВНаличии.ВидДвижения КАК ВидДвижения,
	                      |		ТоварыВНаличии.Номенклатура КАК Номенклатура,
	                      |		ТоварыВНаличии.Характеристика КАК Характеристика,
	                      |		ТоварыВНаличии.Серия КАК Серия,
	                      |		ТоварыВНаличии.Количество КАК Количество,
	                      |		ТоварыВНаличии.Сумма КАК Сумма
	                      |	ИЗ
	                      |		РегистрНакопления.ТоварыВНаличии КАК ТоварыВНаличии
	                      |	ГДЕ
	                      |		ТоварыВНаличии.Регистратор = &Регистратор
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		ДополнительныеРасходы.ВидДвижения,
	                      |		ДополнительныеРасходы.Номенклатура,
	                      |		ДополнительныеРасходы.Характеристика,
	                      |		ДополнительныеРасходы.Серия,
	                      |		0,
	                      |		ДополнительныеРасходы.Сумма
	                      |	ИЗ
	                      |		РегистрНакопления.ДополнительныеРасходы КАК ДополнительныеРасходы
	                      |	ГДЕ
	                      |		ДополнительныеРасходы.Регистратор = &Регистратор) КАК ВЗ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВЗ.Номенклатура,
	                      |	ВЗ.Характеристика,
	                      |	ВЗ.ВидДвижения,
	                      |	ВЗ.Серия");
	Запрос.УстановитьПараметр("Регистратор", Док);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьТекущиеОбщиеОстатки() Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТоварыВНаличииОстатки.Номенклатура КАК Номенклатура,
	                      |	ТоварыВНаличииОстатки.Номенклатура.Единица КАК Единица,
	                      |	ТоварыВНаличииОстатки.КоличествоОстаток КАК Количество
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыВНаличии.Остатки КАК ТоварыВНаличииОстатки");
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции	

#КонецОбласти
